// Завдання: https://shpp.gitbook.io/zero/tutorials/functions/array-reversing
/*Масив у зворотному порядку
У програмуванні є поняття "псевдокод". Це спосіб "схематично" записати код без коду (с) Ваш Кеп.
Структури псевдокоду повністю / майже повністю відповідають справжньому коду, подекуди майже його дублюють. Ну типу:
цеІм'яФункції(цеПараметр)
абоТак(параметр1, параметр2)
цеЗмінна = цеФункціяРезультатЯкоїКладемоУЗмінну()
І т.д.
​
Багато відповідей на програмістські питання, які ви можете нагуглити, будуть саме псевдокодом. Тому важливо розуміти його, вміти адаптувати під реальну програму.
​
Ваше завдання: реалізувати з псевдокоду функцію main і всі функції, що в ній викликані:
це функція main() {
    р = спитатиЛюдинуПроРозмірМасиву()
    створити масив м
    спитатиЛюдинуПроВсіЕлементиМасиву(м, р)
    вивестиНаЕкранКрасивоМасив(м)
    реверснутиМасив(м)
    написати "ось реверснутий масив:"
    вивестиНаЕкранКрасивоМасив(м)
}
Також в кінці не забудьте викликати саму main в головному .
Важливі нюанси цього завдання:
Змінні поза функціями заборонені.
Кожна функція з псевдокоду має бути реалізована саме так, як вона описана. Якщо вказано, що там є параметр — він обов'язковий. Якщо він один — він має бути лише один. Параметр має бути саме тою сутністю, яку вказує псевдокод. І т.д.
Не кожен елемент псевдокоду — функція.
Виклик функції та її оголошення — це не одне й те саме.
Кожна функція, яка наочно показана в псевдокоді саме функцією, має бути самописною (тобто треба написати саме алгоритм, а не заюзати вбудовані функції самої JS).
"Вивести красиво" означає формат "у квадратних дужках через кому з пробілом", тобто:
[q, w, e, r, t, y]
}*/
// Завдання: https://shpp.gitbook.io/zero/tutorials/functions/array-reversing
/*це функція main() {
    р = спитатиЛюдинуПроРозмірМасиву()
    створити масив м
    спитатиЛюдинуПроВсіЕлементиМасиву(м, р)
    вивестиНаЕкранКрасивоМасив(м)
    реверснутиМасив(м)
    написати "ось реверснутий масив:"
    вивестиНаЕкранКрасивоМасив(м)
}*/
function main () {
    let arrayLength = function getArrayLength () {
        arrayLength = +prompt("Введіть довжину масиву: ");

        return arrayLength;
    };
    let array = [];

    function fillArray (array, arrayLength) {
        for (let i = 0; i < arrayLength; i++) {
            array[i] = prompt("Введіть елементи масиву: ");
        }
    }

    function printArray (array) {
        console.put("[");

        for (let i = 0; i < arrayLength; i++) {
            console.put(array[i]);

            if (i < arrayLength - 1) {
                console.put(", ");
            }
        }

        console.put("]");
    }

    function reverseArray (array) {
        let arrayCopy = [];
        let j = arrayLength - 1;

        for (let i = 0; i < arrayLength; i++) {
            arrayCopy[i] = array[i];
        }

        for (let i = 0; i < arrayLength; i++) {
            array[i] = arrayCopy[j];
            j--;
        }
    }

    arrayLength();
    fillArray(array, arrayLength);
    printArray(array);
    reverseArray(array);
    console.log();
    console.log("ось реверснутий масив:");
    printArray(array);
}

main();
